In [1]:
import sqlalchemy as db
from getpass import getpass

In [2]:
password = getpass("Mysql Password: ")

Mysql Password:  ···········

In [3]:
dbName = "publications"
connectionData = f"mysql+pymysql://root:{password}@localhost/{dbName}"

In [4]:
engine = db.create_engine(connectionData)

In [5]:
import pandas as pd

In [6]:
###CHALLENGE 1
#Igual que BONUS en lab-mysql-select

df = pd.read_sql_query("""
SELECT au.au_id AS Author_id,
		au_lname AS Last_name,
        au_fname AS First_name,
        IFNULL(ROUND(SUM(per_title.total_advance + per_title.total_sells),2), 0) AS total_profit
	FROM authors AS au
	LEFT JOIN (SELECT t.title_id, 
					(advance * (royalty/100) * (royaltyper/100)) AS total_advance,
					(price * (royalty/100)*(royaltyper/100)) * cant.cantidad AS total_sells,
					tau.au_id
				FROM titles AS t
					LEFT JOIN titleauthor AS tau
						ON t.title_id = tau.title_id
					LEFT JOIN (SELECT t.title_id,
										SUM(s.qty) AS cantidad
									FROM titles AS t
									LEFT JOIN sales AS s
										ON t.title_id = s.title_id
								GROUP BY t.title_id
							) AS cant
							ON t.title_id = cant.title_id
				) AS per_title
					ON au.au_id = per_title.au_id
GROUP BY Author_id
ORDER BY total_profit DESC;
""", engine
)
df.head(3)

     Author_id Last_name First_name  total_profit
0  722-51-5454  DeFrance     Michel       2721.53
1  213-46-8915     Green   Marjorie       2667.11
2  238-95-7766    Carson     Cheryl       1230.16

In [ ]:
##CHALLENGE 2